In [1]:
import numpy as np
import pandas as pd

In [2]:
label = ['a','b', 'c']
lista = [1,2,3]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30}

In [3]:
pd.Series(lista)

0    1
1    2
2    3
dtype: int64

In [4]:
pd.Series(data=lista, index=label)

a    1
b    2
c    3
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(label)

0    a
1    b
2    c
dtype: object

In [8]:
pd.Series([sum,len,max])

0    <built-in function sum>
1    <built-in function len>
2    <built-in function max>
dtype: object

In [9]:
series = pd.Series([1,2,3,4], index=['A','B','C','D'])
series

A    1
B    2
C    3
D    4
dtype: int64

In [10]:
series.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
series2 = pd.Series([1,2,3,4], index=['A','B','D','E'])

In [12]:
series + series2

A    2.0
B    4.0
C    NaN
D    7.0
E    NaN
dtype: float64

In [13]:
np.random.seed(42)

In [14]:
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [15]:
df.W

A    0.496714
B   -0.234153
C   -0.469474
D    0.241962
E   -1.012831
Name: W, dtype: float64

In [16]:
df['W']

A    0.496714
B   -0.234153
C   -0.469474
D    0.241962
E   -1.012831
Name: W, dtype: float64

In [17]:
df[['W','Y']]

          W         Y
A  0.496714  0.647689
B -0.234153  1.579213
C -0.469474 -0.463418
D  0.241962 -1.724918
E -1.012831 -0.908024

In [18]:
df['Nova'] = df['W']+df['Y']
df

          W         X         Y         Z      Nova
A  0.496714 -0.138264  0.647689  1.523030  1.144403
B -0.234153 -0.234137  1.579213  0.767435  1.345059
C -0.469474  0.542560 -0.463418 -0.465730 -0.932892
D  0.241962 -1.913280 -1.724918 -0.562288 -1.482956
E -1.012831  0.314247 -0.908024 -1.412304 -1.920855

In [19]:
df.drop('Nova',axis=1, inplace=True)
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [20]:
df.drop('E',axis=0, inplace=True)
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288

In [21]:
df.loc['A']

W    0.496714
X   -0.138264
Y    0.647689
Z    1.523030
Name: A, dtype: float64

In [22]:
df.iloc[0]

W    0.496714
X   -0.138264
Y    0.647689
Z    1.523030
Name: A, dtype: float64

In [23]:
df.loc['A','W']

0.4967141530112327

In [24]:
df.loc[['A','B'],['W','Z']]

          W         Z
A  0.496714  1.523030
B -0.234153  0.767435

In [25]:
df.loc[df.index[[0,2]]]

          W         X         Y        Z
A  0.496714 -0.138264  0.647689  1.52303
C -0.469474  0.542560 -0.463418 -0.46573

In [26]:
df[df>0]

          W        X         Y         Z
A  0.496714      NaN  0.647689  1.523030
B       NaN      NaN  1.579213  0.767435
C       NaN  0.54256       NaN       NaN
D  0.241962      NaN       NaN       NaN

In [27]:
df[df>0][['Y','Z']]

          Y         Z
A  0.647689  1.523030
B  1.579213  0.767435
C       NaN       NaN
D       NaN       NaN

In [28]:
df[df>0].loc['A']

W    0.496714
X         NaN
Y    0.647689
Z    1.523030
Name: A, dtype: float64

In [29]:
df[(df['W']> 0) & (df['Z']>1)]

          W         X         Y        Z
A  0.496714 -0.138264  0.647689  1.52303

In [30]:
df.reset_index(inplace=True)
df

  index         W         X         Y         Z
0     A  0.496714 -0.138264  0.647689  1.523030
1     B -0.234153 -0.234137  1.579213  0.767435
2     C -0.469474  0.542560 -0.463418 -0.465730
3     D  0.241962 -1.913280 -1.724918 -0.562288

In [31]:
df.drop('index', axis=1, inplace=True)

In [32]:
novo_index = 'S T E F'.split()

In [33]:
df['NovoIndex'] =  novo_index
df.set_index('NovoIndex', inplace=True)
df

                  W         X         Y         Z
NovoIndex
S          0.496714 -0.138264  0.647689  1.523030
T         -0.234153 -0.234137  1.579213  0.767435
E         -0.469474  0.542560 -0.463418 -0.465730
F          0.241962 -1.913280 -1.724918 -0.562288

In [34]:
fora = ['S','S','S','S','T','T','T','T']
dentro = [1,2,3,4,1,2,3,4]
list_index = list(zip(fora,dentro))
multi_index = pd.MultiIndex.from_tuples(list_index)
multi_index

MultiIndex(levels=[['S', 'T'], [1, 2, 3, 4]],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1], [0, 1, 2, 3, 0, 1, 2, 3]])

In [35]:
df2 = pd.DataFrame(np.random.rand(8,3), index=multi_index, columns=['A','B','C'])
df2

            A         B         C
S 1  0.456070  0.785176  0.199674
  2  0.514234  0.592415  0.046450
  3  0.607545  0.170524  0.065052
  4  0.948886  0.965632  0.808397
T 1  0.304614  0.097672  0.684233
  2  0.440152  0.122038  0.495177
  3  0.034389  0.909320  0.258780
  4  0.662522  0.311711  0.520068

In [36]:
df2.loc['S'].loc[1]

A    0.456070
B    0.785176
C    0.199674
Name: 1, dtype: float64

In [37]:
df2.index.names

FrozenList([None, None])

In [38]:
df2.index.names = ['Grupo', 'Numero']
df2

                     A         B         C
Grupo Numero
S     1       0.456070  0.785176  0.199674
      2       0.514234  0.592415  0.046450
      3       0.607545  0.170524  0.065052
      4       0.948886  0.965632  0.808397
T     1       0.304614  0.097672  0.684233
      2       0.440152  0.122038  0.495177
      3       0.034389  0.909320  0.258780
      4       0.662522  0.311711  0.520068

In [39]:
df2.xs(['S',1])

A    0.456070
B    0.785176
C    0.199674
Name: (S, 1), dtype: float64

In [40]:
df2.xs(1, level='Numero')

              A         B         C
Grupo
S      0.456070  0.785176  0.199674
T      0.304614  0.097672  0.684233

In [41]:
data = {
    'Empresa':['GOO','GOO','MAS','STF','ABC','BANANAS'],
    'Nome':['Sam', 'Vini', 'Denis', 'Fred', 'Gabriel', 'Wesley'],
    'Venda':[100,200,130,250,340,400]   
}
data

{'Empresa': ['GOO', 'GOO', 'MAS', 'STF', 'ABC', 'BANANAS'],
 'Nome': ['Sam', 'Vini', 'Denis', 'Fred', 'Gabriel', 'Wesley'],
 'Venda': [100, 200, 130, 250, 340, 400]}

In [42]:
df3 = pd.DataFrame(data)
df3

   Empresa     Nome  Venda
0      GOO      Sam    100
1      GOO     Vini    200
2      MAS    Denis    130
3      STF     Fred    250
4      ABC  Gabriel    340
5  BANANAS   Wesley    400

In [43]:
df3.groupby('Empresa')

In [44]:
por_empresa = df3.groupby('Empresa')

In [45]:
por_empresa.mean()

         Venda
Empresa
ABC        340
BANANAS    400
GOO        150
MAS        130
STF        250

In [46]:
por_empresa.describe().transpose()

Empresa        ABC  BANANAS         GOO    MAS    STF
Venda count    1.0      1.0    2.000000    1.0    1.0
      mean   340.0    400.0  150.000000  130.0  250.0
      std      NaN      NaN   70.710678    NaN    NaN
      min    340.0    400.0  100.000000  130.0  250.0
      25%    340.0    400.0  125.000000  130.0  250.0
      50%    340.0    400.0  150.000000  130.0  250.0
      75%    340.0    400.0  175.000000  130.0  250.0
      max    340.0    400.0  200.000000  130.0  250.0

In [47]:
por_empresa.describe().transpose()['GOO']

Venda  count      2.000000
       mean     150.000000
       std       70.710678
       min      100.000000
       25%      125.000000
       50%      150.000000
       75%      175.000000
       max      200.000000
Name: GOO, dtype: float64

In [48]:
df = pd.DataFrame({'col1':[1,2,3,4], 'col2':[444,555,666,444], 'col3':['aaa','bbb','ccc','ddd']})
df

   col1  col2 col3
0     1   444  aaa
1     2   555  bbb
2     3   666  ccc
3     4   444  ddd

In [49]:
df['col2'].unique()

array([444, 555, 666])

In [50]:
df['col2'].nunique()

3

In [51]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [52]:
def elev_quad(x):
    return x**2

In [53]:
df['col1'].apply(elev_quad)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [54]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [55]:
df = pd.DataFrame({'col1':[1,np.nan,3,4], 'col2':[np.nan,555,666,444], 'col3':['aaa','bbb',np.nan,'ddd']})
df

   col1   col2 col3
0   1.0    NaN  aaa
1   NaN  555.0  bbb
2   3.0  666.0  NaN
3   4.0  444.0  ddd

In [56]:
df.isna()

    col1   col2   col3
0  False   True  False
1   True  False  False
2  False  False   True
3  False  False  False

In [57]:
df.dropna()

   col1   col2 col3
3   4.0  444.0  ddd

In [58]:
df.fillna('Valor nulo')

         col1        col2        col3
0           1  Valor nulo         aaa
1  Valor nulo         555         bbb
2           3         666  Valor nulo
3           4         444         ddd